
#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ПутьКФайлуВыгрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файл выгрузки правил дианостики (*.xml)|*.xml";
	Диалог.Заголовок = "";
	Если Диалог.Выбрать() Тогда
		ПутьКФайлуВыгрузки = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если ПустаяСтрока(ПутьКФайлуВыгрузки) Тогда
		Предупреждение("Путь к файлу выгрузки не заполнен");
		Возврат;
	КонецЕсли;
	ВыгрузитьПравилаПроверкиКода();
	
КонецПроцедуры

#КонецОбласти